Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.CanAddEntry(Autodesk.Revit.DB.KeyBasedTreeEntry)
Verifies if the KeyBasedTreeEntry could be added in this KeyBasedTreeEntriesLoadContent.
entry:
The KeyBasedTreeEntry object to be checked.
Returns:
True if the KeyBasedTreeEntry could be added in, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.IsEntriesBuilt(Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent)
Verifies that the KeyBasedTreeEntries object owned by a KeyBasedTreeEntriesLoadContent object is built.
content:
The KeyBasedTreeEntriesLoadContent object to be checked.
Returns:
True if the KeyBasedTreeEntries object is built already, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.Reset
Clears KeyBasedTreeEntriesLoadContent object, including KeyBasedTreeEntries and KeyBasedTreeEntriesLoadResults, owned by this KeyBasedTreeEntriesLoadContent object.
Remarks:
This method can be used to clear all data that has been added to this KeyBasedTreeEntriesLoadContent object to date
so that the caller can start adding and building KeyBasedTreeEntries again.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.GetLoadResults
Returns a copy of the KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.
Remarks:
IExternalResourceServers can use this object to report data and results
back to Revit from their LoadResource methods.
Returns:
A copy of a KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.GetEntries
Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.
Returns:
A copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is not built yet. The information about this KeyBasedTreeEntries object is not available.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.BuildEntries
Builds a KeyBasedTreeEntries object.
Remarks:
This method will take all the entries that have been added, create a KeyBasedTreeEntries object out of these entries,
and also record possible errors that occurred while constructing this KeyBasedTreeEntries object.
After this function is called, no more entries can be added. And repeated calling of this function is not allowed either.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is built already.
Adding more KeyBasedTreeEntries as well as repeated building, is not supported.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.AddEntry(Autodesk.Revit.DB.KeyBasedTreeEntry)
Adds one KeyBasedTreeEntry to this KeyBasedTreeEntriesLoadContent, which is used to build a KeyBasedTreeEntries object by BuildEntries function.
Remarks:
The entry will not be added if it is invalid or duplicate with the added entries.
entry:
The entry to be added.
Returns:
Returns true if an entry is added into the entry data set successfully,
returns false if an entry fails to be added because this entry is invalid or a duplicate
of one in the entry data set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The KeyBasedTreeEntry object is not appropriate to be added in this KeyBasedTreeEntriesLoadContent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is built already.
Adding more KeyBasedTreeEntries as well as repeated building, is not supported.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent
This class is used by IExternalResourceServers to return KeyBasedTreeEntries data to Revit when their
LoadResource method is invoked.
Remarks:
The class contains a KeyBasedTreeEntries object which should hold the KeyBasedTreeEntries data generated by the
IExternalResourceServer.
An ExternalResourceServer can create the KeyBasedTreeEntries from an arbitrary data source by using AddEntry
to add individual KeyBasedTreeEntries. Once all the desired entries have been added, BuildEntries can be called
to construct the KeyBasedTreeEntries object from the individual entries that were added.
KeyBasedTreeEntriesLoadContent must have a built KeyBasedTreeEntries before its LoadStatus property
can be set to ExternalResourceLoadStatus.Success.
Since:
2015